---
kind: type
id: T:Autodesk.Revit.DB.GroupNode
source: html/8b1cabde-3c37-1735-a186-2ce026555ce0.htm
---
# Autodesk.Revit.DB.GroupNode

A node that represents set of individual elements grouped together
 in some form, such as an instance of a family or linked Revit file, or an instance of a part of symbol's geometry.

## Syntax (C#)
```csharp
public class GroupNode : RenderNode
```